## Env: `production`
#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

module.roles.data.terraform_remote_state.secretsmanager: Reading...
module.roles.data.aws_secretsmanager_secret.rds_arn: Reading...
module.roles.data.aws_secretsmanager_secret.external_svc_api_keys_arn: Reading...
module.roles.data.aws_iam_policy_document.access_ecr_policy_document: Reading...
module.roles.data.aws_iam_policy_document.app_runner_build_assume_role_policy: Reading...
module.roles.data.aws_iam_policy_document.app_runner_assume_role_policy: Reading...
module.roles.data.aws_iam_policy_document.access_ecr_policy_document: Read complete after 0s [id=3399376575]
module.roles.data.aws_iam_policy_document.app_runner_build_assume_role_policy: Read complete after 0s [id=3710474894]
module.roles.data.aws_iam_policy_document.app_runner_assume_role_policy: Read complete after 0s [id=284219616]
module.roles.data.terraform_remote_state.secretsmanager: Read complete after 0s
module.roles.data.aws_secretsmanager_secret.rds_arn: Read complete after 0s [id=arn:aws:secretsmanager:us-east-2:043309351324:secret:rds!db-ebed39de-19fd-4df5-a07e-a727b19ff015-Bm0zdg]
module.roles.data.aws_secretsmanager_secret.external_svc_api_keys_arn: Read complete after 0s [id=arn:aws:secretsmanager:us-east-2:043309351324:secret:EXTERNAL_SVC_API_KEYS-DRf7c7]
module.roles.data.aws_iam_policy_document.read_secret_policy_document: Reading...
module.roles.data.aws_iam_policy_document.read_secret_policy_document: Read complete after 0s [id=1223347949]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.roles.aws_iam_policy.access_ecr_policy will be created
  + resource "aws_iam_policy" "access_ecr_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy to access ecr"
      + id               = (known after apply)
      + name             = "access_ecr_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.roles.aws_iam_policy.read_secret_policy will be created
  + resource "aws_iam_policy" "read_secret_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy to read secret"
      + id               = (known after apply)
      + name             = "read_secret_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-2:043309351324:secret:resource/prod/database/postgres-1uOuWb",
                          + "arn:aws:secretsmanager:us-east-2:043309351324:secret:rds!db-ebed39de-19fd-4df5-a07e-a727b19ff015-Bm0zdg",
                          + "arn:aws:secretsmanager:us-east-2:043309351324:secret:app/prod/keys-EwW2Qc",
                          + "arn:aws:secretsmanager:us-east-2:043309351324:secret:app/prod/internal_svc_keys-ESvf2N",
                          + "arn:aws:secretsmanager:us-east-2:043309351324:secret:EXTERNAL_SVC_API_KEYS-DRf7c7",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.roles.aws_iam_role.infra_app_runner_build will be created
  + resource "aws_iam_role" "infra_app_runner_build" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "build.apprunner.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "us-east-2-infra-apprunner-build"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.roles.aws_iam_role.infra_app_runner_exe will be created
  + resource "aws_iam_role" "infra_app_runner_exe" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "tasks.apprunner.amazonaws.com"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "build.apprunner.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "us-east-2-infra-apprunner-exe"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.roles.aws_iam_role_policy_attachment.access_ecr_policy_infra_app_runner_build will be created
  + resource "aws_iam_role_policy_attachment" "access_ecr_policy_infra_app_runner_build" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "us-east-2-infra-apprunner-build"
    }

  # module.roles.aws_iam_role_policy_attachment.read_secret_policy_infra_app_runner_exe will be created
  + resource "aws_iam_role_policy_attachment" "read_secret_policy_infra_app_runner_exe" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "us-east-2-infra-apprunner-exe"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + infra_app_runner_build_arn = (known after apply)
  + infra_app_runner_exe_arn   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*